PANDAS

In [1]:
import pandas as pd

#### Pandas Serisi Oluşturmak

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri = pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.size

5

In [9]:
seri.ndim

1

In [10]:
seri.values

array([1, 2, 3, 4, 5])

In [11]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
seri.head(2)

0    1
1    2
dtype: int64

In [13]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [14]:
#index isimlendirmesi

In [28]:
seri = pd.Series([99,22,332],index=["1","3","5"])
seri

1     99
3     22
5    332
dtype: int64

In [29]:
seri["1":"5"]

1     99
3     22
5    332
dtype: int64

In [30]:
#sozluk üzerinden seri oluşturmak

In [31]:
sozluk = pd.Series({"reg":10,"log":11,"cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [32]:
# iki seriyi birlestirerek seri olusturma

In [33]:
pd.concat([seri,seri])

1     99
3     22
5    332
1     99
3     22
5    332
dtype: int64

### Eleman İşlemleri

In [34]:
import numpy as np
a = np.array([1,2,33,444,75])

In [37]:
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [38]:
seri[0]

1

In [39]:
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [43]:
seri.keys()

RangeIndex(start=0, stop=5, step=1)

In [45]:
list(seri.items())

[(0, 1), (1, 2), (2, 33), (3, 444), (4, 75)]

In [46]:
seri.values

array([  1,   2,  33, 444,  75])

### Eleman Sorgulama

In [50]:
1 in seri

True

In [49]:
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [51]:
seri[1]

2

In [52]:
#fancy eleman

In [53]:
seri[[0,1,3]]

0      1
1      2
3    444
dtype: int64

In [54]:
seri[0] = 131

In [55]:
seri

0    131
1      2
2     33
3    444
4     75
dtype: int64

### Pandas Dataframe Oluşturma

In [56]:
l=[1,2,3]
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3

In [57]:
import numpy as np

In [58]:
m=np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [61]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [62]:
df.columns=("deg1","deg2","deg3")

In [63]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [65]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [64]:
type(df.values)

numpy.ndarray

In [66]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [67]:
a = np.array([1,2,3,4,5])

In [68]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

### Eleman İşlemleri

In [69]:
import numpy as np

In [89]:
s1 = np.random.randint(0,10,(5))
s2 = np.random.randint(0,10,(5))
s3 = np.random.randint(0,10,(5))

In [90]:
sozluk = {"var1":s1,"var2":s2,"var3":s3}
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     3     6     9
1     7     0     5
2     5     0     5
3     0     7     4
4     8     7     6

In [73]:
df[0:1]

   var1  var2  var3
0     8     5     7

In [74]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [91]:
df.index=["a","b","c","d","e"]

In [76]:
df

   var1  var2  var3
a     8     5     7
b     8     9     8
c     1     2     8
d     5     0     6
e     5     3     1

In [77]:
df["b":"d"]

   var1  var2  var3
b     8     9     8
c     1     2     8
d     5     0     6

In [80]:
df.drop("a",axis=0,inplace=True)

In [81]:
df

   var1  var2  var3
b     8     9     8
c     1     2     8
d     5     0     6
e     5     3     1

In [82]:
df.drop(["c","d"],axis=0,inplace=True)

In [83]:
df

   var1  var2  var3
b     8     9     8
e     5     3     1

In [85]:
"var1" in df

True

In [86]:
l = ["var1","var4","var2"]

In [87]:
for i in l:
    print(i in df)

True
False
True

In [92]:
df

   var1  var2  var3
a     3     6     9
b     7     0     5
c     5     0     5
d     0     7     4
e     8     7     6

In [93]:
df["var4"] = df["var1"] / df["var2"]

In [94]:
df

   var1  var2  var3      var4
a     3     6     9  0.500000
b     7     0     5       inf
c     5     0     5       inf
d     0     7     4  0.000000
e     8     7     6  1.142857

In [95]:
#degisken silme

In [98]:
df.drop("var4",axis=1,inplace=True)

In [99]:
df

   var1  var2  var3
a     3     6     9
b     7     0     5
c     5     0     5
d     0     7     4
e     8     7     6

In [100]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3
a     9
b     5
c     5
d     4
e     6

### Gözlem ve Değişken Seçimi  LOC ve ILOC

In [102]:
m = np.random.randint(1,30,(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     6    27    21
1    22     7    10
2    22    18    13
3     3     4    17
4    27    21    25
5    21    14    18
6    28     4    11
7    21    17     8
8    24    14    24
9    28    14     5

In [103]:
#loc tanımlandığı şekilde kullanmak için kullanılır.

In [104]:
#iloc indeksleme mantığıyla seçim yapar.

In [105]:
df.loc[0:3]

   var1  var2  var3
0     6    27    21
1    22     7    10
2    22    18    13
3     3     4    17

In [106]:
df.iloc[0:3]

   var1  var2  var3
0     6    27    21
1    22     7    10
2    22    18    13

In [107]:
df.iloc[0,0]

6

In [111]:
list(map(lambda x: x**2 , df.iloc[:3,0].values))

[36, 484, 484]

In [112]:
df.loc[0:3,"var3"]

0    21
1    10
2    13
3    17
Name: var3, dtype: int64

In [113]:
df.iloc[0:3,1:3]

   var2  var3
0    27    21
1     7    10
2    18    13

In [115]:
df.iloc[0:3]["var3"]

0    21
1    10
2    13
Name: var3, dtype: int64

In [116]:
df["var1"]

0     6
1    22
2    22
3     3
4    27
5    21
6    28
7    21
8    24
9    28
Name: var1, dtype: int64

In [117]:
df["var1"][0:2]

0     6
1    22
Name: var1, dtype: int64

In [118]:
df[0:2]

   var1  var2  var3
0     6    27    21
1    22     7    10

In [119]:
df[0:2]["var1"]

0     6
1    22
Name: var1, dtype: int64

In [120]:
df[0:2][["var1","var3"]]

   var1  var3
0     6    21
1    22    10

In [123]:
df[["var1","var3"]].head()

   var1  var3
0     6    21
1    22    10
2    22    13
3     3    17
4    27    25

In [125]:
pd.concat([df,df],ignore_index=True)

    var1  var2  var3
0      6    27    21
1     22     7    10
2     22    18    13
3      3     4    17
4     27    21    25
5     21    14    18
6     28     4    11
7     21    17     8
8     24    14    24
9     28    14     5
10     6    27    21
11    22     7    10
12    22    18    13
13     3     4    17
14    27    21    25
15    21    14    18
16    28     4    11
17    21    17     8
18    24    14    24
19    28    14     5

### İleri Birleştirme İşlemkeri

In [126]:
df1 = pd.DataFrame({
    'calisanlar':["Ali","Veli","Ayse","Fatma"],
    'grup':["Muhasebe","Muhendislik","Muhendislik","İK"]
})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [127]:
df2 = pd.DataFrame({
    'calisanlar':["Ali","Veli","Ayse","Fatma"],
    'ilk_giriş':[2010,2009,2014,2019]
})
df2

  calisanlar  ilk_giriş
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [128]:
#birebir birleştirme

In [129]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giriş
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2019

In [130]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar         grup  ilk_giriş
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2019

In [131]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giriş
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           İK       2019

In [132]:
df4 = pd.DataFrame({
    "grup":["Muhasebe","Muhendislik","İK"],
    'mudur':["Caner","Mustafa","Berkcan"]
})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [133]:
# Many to one birleştirme

In [134]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giriş    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan

In [139]:
# Many to Many birleştirme

In [136]:
df5 = pd.DataFrame({
    'grup':["Muhasebe","Muhasebe","Muhendislik","Muhendislik","İK","İK"],
    'yetenekler':["matematik","excel","kodlama","linux","excel","yonetim"]
})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [137]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [138]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

# Aggregation Functions

In [140]:
import seaborn as sns

In [142]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      ~/anaconda3/lib/python3.8/site-packages/seaborn/utils.py
Type:      function

In [144]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [145]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [148]:
df.shape

(1035, 6)

In [149]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [150]:
df["mass"].mean()

2.6381605847953233

In [151]:
df["mass"].min()

0.0036

In [152]:
df["mass"].std()

3.8186166509616046

In [154]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [155]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [156]:
df = pd.DataFrame({
    'gruplar':["A","B","C","A","B","C"],
    'veri':[10,11,52,23,43,55]},columns=["gruplar","veri"]
)
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [157]:
df.groupby("gruplar")

In [158]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [159]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [161]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [164]:
df.groupby("method")["orbital_period"].mean().sort_values()

method
Orbital Brightness Modulation         0.709307
Transit                              21.102073
Transit Timing Variations            79.783500
Astrometry                          631.180000
Radial Velocity                     823.354680
Pulsation Timing Variations        1170.000000
Microlensing                       3153.571429
Eclipse Timing Variations          4751.644444
Pulsar Timing                      7343.021201
Imaging                          118247.737500
Name: orbital_period, dtype: float64

In [165]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# İleri Toplulaştırma İşlemleri (Aggreagate ,filter ,transform ,apply )

In [166]:
df = pd.DataFrame({
    'gruplar':["A","B","C","A","B","C"],
    'degisken1':[10,23,33,22,11,99],
    'degisken2':[100,253,333,262,111,969],
},columns=["gruplar","degisken1","degisken2"]
)
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [167]:
# aggregate

In [170]:
df.groupby("gruplar").describe()

        degisken1                                                degisken2  \
            count  mean        std   min   25%   50%   75%   max     count
gruplar
A             2.0  16.0   8.485281  10.0  13.0  16.0  19.0  22.0       2.0
B             2.0  17.0   8.485281  11.0  14.0  17.0  20.0  23.0       2.0
C             2.0  66.0  46.669048  33.0  49.5  66.0  82.5  99.0       2.0


          mean         std    min    25%    50%    75%    max
gruplar
A        181.0  114.551299  100.0  140.5  181.0  221.5  262.0
B        182.0  100.409163  111.0  146.5  182.0  217.5  253.0
C        651.0  449.719913  333.0  492.0  651.0  810.0  969.0

In [171]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [172]:
df.groupby("gruplar").aggregate({"degisken1":["min","max"],"degisken2":[np.mean]})

        degisken1     degisken2
              min max      mean
gruplar
A              10  22       181
B              11  23       182
C              33  99       651

In [173]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

### Filter

In [174]:
def filter_func(x):
    return x["degisken1"].std()>9

In [176]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [175]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

### Transform

In [181]:
df_a = df.iloc[:,1:]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [182]:
df_a.transform(lambda x: (x-x.mean()) / x.std() ) # sütün sütün çalışıyor.

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

### APPLY FUNCTION

In [183]:
df_a.apply(np.sum) #sütun bazlı çalışır.

degisken1     198
degisken2    2028
dtype: int64

In [184]:
df_a.apply(lambda x: x-5)

   degisken1  degisken2
0          5         95
1         18        248
2         28        328
3         17        257
4          6        106
5         94        964

In [185]:
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [186]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [187]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

### Pivot Tablolar

In [188]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [190]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [194]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [195]:
#pivot ile table

In [196]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [197]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [200]:
age = pd.cut(titanic["age"],[0,18,90]) #Sürekli değeri kategorilendirme
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [203]:
titanic.pivot_table("survived",["sex",age],"class").unstack()

class      First            Second               Third
age      (0, 18]  (18, 90] (0, 18]  (18, 90]   (0, 18]  (18, 90]
sex
female  0.909091  0.972973     1.0  0.900000  0.511628  0.423729
male    0.800000  0.375000     0.6  0.071429  0.215686  0.133663

In [205]:
pd.read_csv("ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [206]:
pd.read_csv("duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [208]:
df = pd.read_excel("ornekx.xlsx")
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [209]:
df.columns = ("A","B","C")

In [210]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [211]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      ~/anaconda3/lib/python3.8/site-packages/seaborn/utils.py
Type:      function

In [216]:
import numpy as np
m = np.arange(1,7).reshape((3,2))
a = pd.DataFrame(m, columns = ["var1","var2"])
a

   var1  var2
0     1     2
1     3     4
2     5     6

In [215]:
b = a+9
b

   var1  var2
0    10    11
1    12    13
2    14    15

In [217]:
df.head()

    A    B    C
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [218]:
df["A"]

0      78
1      78
2      78
3       7
4      88
5       6
6      56
7       7
8      56
9     346
10      5
11    456
12      3
Name: A, dtype: int64

In [219]:
df["A"].dtype

dtype('int64')

In [220]:
6 in df["A"]

True